InformationRegisters/Зарплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>Зарплата</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущаяЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСЗП/Ext/Module.bsl
Процедура ПосчитатьЗарплату (Зарплата_ , фио,Дата) Экспорт

Отбор = Новый Структура("ФИО", фио);
ЗначениеРесурсов = РегистрыСведений.Зарплата.ПолучитьПоследнее(Дата,Отбор);

Запись = РегистрыСведений.Зарплата.СоздатьМенеджерЗаписи();
Запись.ТекущаяЗарплата = Зарплата_ + ЗначениеРесурсов.ТекущаяЗарплата;
Запись.ФИО = фио;
Запись.Период = Дата;
Запись.Записать();
КонецПроцедуры
